In [2]:
import pandas as pd
import numpy as np

A series is a one dimensional labeled array capable of holding any data type. The axis labels are collectively called as index.

In [3]:
labels=['a','b','c']
my_list=[1,2,3]
pd.Series(my_list)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [5]:
ar=np.array([1,2,3])
pd.Series(ar)

0    1
1    2
2    3
dtype: int64

In [6]:
d={'1':1,'2':2,'3':3}
pd.Series(d)

1    1
2    2
3    3
dtype: int64